In [3]:
#Importar a biblioteca Pandas 
import pandas as pd

In [5]:
df1 = pd.read_excel("dataset/Aracaju.xlsx")
df2 = pd.read_excel("dataset/Fortaleza.xlsx")
df3 = pd.read_excel("dataset/Natal.xlsx")
df4 = pd.read_excel("dataset/Recife.xlsx")
df5 = pd.read_excel("dataset/Salvador.xlsx")

In [6]:
df3.head()
#Trabalho com planilhas Excel 03:00

  Cidade       Data  Vendas  LojaID  Qtde
0  Natal 2018-08-27   606.0     853     2
1  Natal 2018-11-25   563.0     853     2
2  Natal 2019-03-11   308.0     852     3
3  Natal 2019-01-07   271.0     854     3
4  Natal 2019-03-09   699.0     853     3

In [7]:
df = pd.concat([df1,df2,df3,df4,df5])

In [8]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [9]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [10]:
#Pegar amostra de linhas 
df.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde
5     Aracaju 2018-01-01  156.20    1522     1
165  Salvador 2019-01-02   11.54    1037     1
105   Aracaju 2018-01-01   24.81    1520     5
99      Natal 2019-01-02   40.38    1037     1
204     Natal 2019-01-02  151.41    1037     2

In [12]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [16]:
df["LojaID"] = df["LojaID"].astype("object")

In [18]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [20]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [22]:
#valores nulos ficaram com media(em memória) - tabela nao tem valores nulos no momento, só fixando 
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [23]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [24]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
139      Natal 2019-01-02  169.01   1036     1
15       Natal 2018-02-01  432.00    854     3
220   Salvador 2019-01-02   42.71   1035     1
43     Aracaju 2018-01-01   19.63   1523     9
232   Salvador 2019-01-03  167.76   1034     3
70      Recife 2019-01-01   20.40    983     7
48       Natal 2018-09-20  676.00    852     4
172   Salvador 2019-01-02    6.70   1035     1
130     Recife 2019-03-02   12.36    983     4
19    Salvador 2019-01-01  167.12   1035     1
116      Natal 2019-01-02   41.78   1034     3
119      Natal 2019-01-02  136.37   1034     2
0    Fortaleza 2019-01-01   45.27   1002     2
113      Natal 2019-01-02   18.90   1034     3
75     Aracaju 2018-01-01  160.64   1523     9

In [27]:
#média de vendas
df["Vendas"].mean()

122.61180089485438

In [31]:
#substituir valores vazios por 0 - fixando 
df["Vendas"].fillna(0, inplace=True)

In [32]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [33]:
#caso tenha valores 0, forma de apagar:
df.dropna(inplace=True)

In [34]:
# deletar onde a coluna vendas aparece valores nulos 
df.dropna(subset=["Vendas"], inplace=True)

In [36]:
#remover colunas com valores faltantes=
df.dropna(how="all", inplace=True)

In [38]:
#criando uma coluna receita  
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [39]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [40]:
#caso a quantidade não fosse mostrada, e tivesse a receita antes,
#A criação de coluna poderia ser realizada dessa forma: 
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [41]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [42]:
df["Receita"].max()

3544.0

In [43]:
df["Receita"].min()

3.34

In [44]:
# As 3 maiores receitas 
df.nlargest(3,"Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [46]:
#As 3 piores receitas
df.nsmallest(3,"Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [47]:
#agrupamento da soma de receita por cidades 
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [48]:
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0